---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingCurvesNotSplitRamp
source: html/069c7b48-6de8-cc34-ff95-65ac7db08f66.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingCurvesNotSplitRamp Property

The slope of this railing will not parallel the ramp at landings. To get a parallel railing, split the railing sketch at the ends of landings.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingCurvesNotSplitRamp { get; }
```